app/controllers/hero_powers_controller.rb

    def create
        item = HeroPower.create(hero_power_params)
---
INSERT INTO "hero_powers" ("strength", "power_id", "hero_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["strength", 1], ["power_id", 1], ["hero_id", 1], ["created_at", "2023-03-23 20:01:53.381627"], ["updated_at", "2023-03-23 20:01:53.381627"]]

    def index
        all = HeroPower.all
---
SELECT "hero_powers".* FROM "hero_powers"