app/controllers/heros_controller.rb

INSERT INTO "heros" ("name", "super_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Ian"], ["super_name", "Super man"], ["created_at", "2023-03-23 18:22:17.994496"], ["updated_at", "2023-03-23 18:22:17.994496"]]
---
    def create
        person = Hero.create(hero_params)

SELECT "heros".* FROM "heros"
---
    def index
        render json: Hero.all, status: 200, except: [:created_at, :updated_at]

SELECT "heros".* FROM "heros" WHERE "heros"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        hero = Hero.find(params[:id])

SELECT "heros".* FROM "heros" WHERE "heros"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "heros" WHERE "heros"."id" = ?  [["id", 8]]
---
    def destroy
        hero = Hero.find(params[:id])
        if hero
            hero.destroy