app/controllers/powers_controller.rb

    def create
        power = Power.create(power_params)
---
INSERT INTO "powers" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)

    def index
        render json: Power.all, status: :ok
---
SELECT "powers".* FROM "powers"

    def show
        power = Power.find(params[:id])
---
SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        power = Power.find(params[:id])

        if power
            result = power.update(power_params)
---
SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "powers" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "powers"."id" = ?  [["name", "Invisibility"], ["description", "With this power, one has the ability to be invinsible anywhere and everywhere"], ["updated_at", "2023-03-25 05:06:12.528250"], ["id", 2]]

    def destroy
        power = Power.find(params[:id])
        if power
            power.destroy
---
SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
DELETE FROM "powers" WHERE "powers"."id" = ?  [["id", 12]]